bool isPowerOfThree(int n) {
    
    // 小於 3 以後，可以判斷是否為 3 個次方。
    if(n < 3){
        return (n == 1);
    }
    
    // 如果 mod 3 不等於 0，一定不是 3 的次方。
    if((n % 3) != 0){
        return 0;
    }
    
    // 如果 mod 3 等於 0，除以 3 之後繼續往下找。
    return isPowerOfThree(n / 3);
    
    // integer 最大的 3 次方數字，一定可以整除 3的任一次方數字。
    // return (n > 0) ? (1162261467 % n) == 0 : 0;
    
    // 或是數字不多可以直接列出
    // int result = (n == 1)
    //          | (n == 3)
    //          | (n == 9)
    //          | (n == 27)
    //          | (n == 243)
    //          | (n == 729)
    //          | (n == 2187)
    //          | (n == 6561)
    //          | (n == 19683)
    //          | (n == 59049)
    //          | (n == 177147)
    //          | (n == 531441)
    //          | (n == 1594323)
    //          | (n == 4782969)
    //          | (n == 14348907)
    //          | (n == 43046721)
    //          | (n == 129140163)
    //          | (n == 387420489)
    //          | (n == 1162261467)
    //          | (n == 4782969);
}